In [2]:
import pandas as pd
import numpy as np

In [ ]:
l = [Item_Weight=500,
 Item_Fat_Content=Regular
 Item_Type=Dairy
 Item_MRP=26
 Outlet_Size=Small
 Outlet_Location_Type=Tier 1
 Outlet_Establishment_Year=1996]

In [2]:
a = dict(Item_Weight=[500], Item_Fat_Content=['Regular'], Item_Type=['Dairy'])
a

{'Item_Weight': [500], 'Item_Fat_Content': ['Regular'], 'Item_Type': ['Dairy']}

In [34]:
print(a)

{'Item_Weight': [500], 'Item_Fat_Content': ['Regular'], 'Item_Type': ['Dairy']}

In [16]:
c = a.keys()
d=list(c)
d

['Item_Weight', 'Item_Fat_Content', 'Item_Type']

In [17]:
df = pd.DataFrame.from_dict(a)

In [18]:
df

   Item_Weight Item_Fat_Content Item_Type
0          500          Regular     Dairy

In [23]:
d=df.columns

In [3]:
b = ['Item_Fat_Content','Item_Type','Item_Weight']

In [30]:
for e in d:
    print(e in b)

True
True
True

In [29]:
e = 'Item_Weight'
e in b

True

In [31]:
l = []
for i in range(4):
    l.append(i)
    
l

[0, 1, 2, 3]

In [32]:
l

[0, 1, 2, 3]

In [33]:
I = [1,2,3,4,5]
v = [x&1 for x in I]
print(v)

[1, 0, 1, 0, 1]

In [40]:
x=9

In [41]:
x&1

1

In [42]:
b = ['Item_Fat_Content','Item_Type','Item_Weight']
d = ['Item_Fat_Content','Item_Type','Item_Weight','abbc','dfghjk']

d.

TypeError: unsupported operand type(s) for -: 'list' and 'list'

In [3]:
data = pd.read_csv('Data_Set/Train.csv')

In [5]:
inputColumnNames = data.columns

In [6]:
missingColumns = [i for i in inputColumnNames if data[i].isnull().sum()>0]

In [7]:
missingColumns

['Item_Weight', 'Outlet_Size']

In [11]:
data = pd.DataFrame({'Year':[1999,1995,np.nan,2000,2010,np.nan], 'Value':[1,2,3,4,5,6]})
data

     Year  Value
0  1999.0      1
1  1995.0      2
2     NaN      3
3  2000.0      4
4  2010.0      5
5     NaN      6

In [12]:
data['Year'].isnull().sum()

2

In [14]:
from datetime import datetime

In [15]:
datetime.now().year

2022

In [16]:
data['age'] = datetime.now().year-data['Year']

In [17]:
data

     Year  Value   age
0  1999.0      1  23.0
1  1995.0      2  27.0
2     NaN      3   NaN
3  2000.0      4  22.0
4  2010.0      5  12.0
5     NaN      6   NaN

In [18]:
data['Year']

0    1999.0
1    1995.0
2       NaN
3    2000.0
4    2010.0
5       NaN
Name: Year, dtype: float64

In [45]:
data = pd.DataFrame({'Year':[1999,1995,np.nan,2000,2010,np.nan,'\t',], 'Value':[1,2,3,4,5,6,7]})
data

   Year  Value
0  1999      1
1  1995      2
2   NaN      3
3  2000      4
4  2010      5
5   NaN      6
6    \t      7

In [20]:
def getAge(data):
    data['AGE'] = datetime.now().year-data['Year']
    return data['AGE']

Age = getAge(data)
Age

0    23.0
1    27.0
2     NaN
3    22.0
4    12.0
5     NaN
Name: AGE, dtype: float64

In [21]:
for i in Age:
    print(i)

23.0
27.0
nan
22.0
12.0
nan

In [23]:
import glob
inputFilelist = glob.glob('Prediction_Files/*.csv')
inputFilelist

['Prediction_Files\\input_data123.csv']

In [24]:
inputFilelist[0]

'Prediction_Files\\input_data123.csv'

In [41]:
inputFilelist[0].split('\\')[1].split('.')[0] + '_result' +'.csv'

'input_data123_result.csv'

In [36]:
inputFilelist[0].split('\\')[1]

'input_data123.csv'

In [37]:
fileName = inputFilelist[0].split('\\')[1].split('.')[0]

In [39]:
name = f'Prediction_Files/{fileName}_result.csv'
name

'Prediction_Files/input_data123_result.csv'

In [46]:
a = ['a', 'b', 'c']

In [47]:
df=pd.DataFrame(a)

In [62]:
df

   0
0  a
1  b
2  c

In [49]:
from sklearn.preprocessing import OrdinalEncoder

In [50]:
od = OrdinalEncoder(handle_unknown='use_encoded_value')

In [52]:
od.fit_transform(df[0])

TypeError: unknown_value should be an integer or np.nan when handle_unknown is 'use_encoded_value', got None.

In [53]:
dic = {'sumegh':1, "bijoy":2, "nandini":3}

In [59]:
l = list(dic.keys())

In [61]:
l.sample(1)

AttributeError: 'list' object has no attribute 'sample'

In [66]:
dic = {'size':['small','big','mediam','small'],
'Ratting':['High','Veryhigh','small','verysmall']}

df1 = pd.DataFrame.from_dict(dic)
df1

     size    Ratting
0   small       High
1     big   Veryhigh
2  mediam      small
3   small  verysmall

In [71]:
from sklearn.preprocessing import OrdinalEncoder
od = OrdinalEncoder(handle_unknown='use_encoded_value')
od.fit_transform(df1['size'])

TypeError: unknown_value should be an integer or np.nan when handle_unknown is 'use_encoded_value', got None.

In [72]:
df = pd.read_csv('Data_Set/Train.csv')
df.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [85]:
df['Item_Fat_Content'].dtype == 'O'

True

In [86]:
l = ['Item_Identifier','Item_Weight','Item_Fat_Content']

for i in l:
   if i == 'Item_Fat_Content':
    print(i)

Item_Fat_Content

In [ ]:
["Item_Type","Item_Weight","Item_Fat_Content","Item_MRP","Outlet_Size","Outlet_Location_Type","Outlet_Establishment_Year"]

In [97]:
MissingValueImputerDictionary = {"Item_Type":"Others", "Item_Weight":12.6, "Item_Fat_Content": "Low Fat","Item_MRP": 143.0128, "Outlet_Size":"Small", "Outlet_Location_Type":"Tier 3", "Outlet_Establishment_Year": 23}

In [100]:
MissingValueImputerDictionary['Item_MRP']

143.0128

In [88]:
from datetime import datetime
df['Age']= datetime.now().year - df["Outlet_Establishment_Year"]

In [95]:
(df['Age'].median())

23.0

In [96]:
2022-23.0

1999.0

In [109]:
data = pd.DataFrame({'Year':[1999,1995,np.nan,2000,2010,np.nan], 'Value':[1,2,3,4,5,6]})
data

     Year  Value
0  1999.0      1
1  1995.0      2
2     NaN      3
3  2000.0      4
4  2010.0      5
5     NaN      6

In [113]:
data.to_csv('Deleted file/SUMEGH.csv')

In [111]:
Ml = {"Year":20000,"Value":3}

In [112]:
for i in data.columns:
    data[i].fillna(Ml[i],inplace=True)
    
data

      Year  Value
0   1999.0      1
1   1995.0      2
2  20000.0      3
3   2000.0      4
4   2010.0      5
5  20000.0      6

In [106]:
for i, feature in enumerate(MissingValueImputerDictionary):
    print(feature + "\t" + str(i))

Item_Type	0
Item_Weight	1
Item_Fat_Content	2
Item_MRP	3
Outlet_Size	4
Outlet_Location_Type	5
Outlet_Establishment_Year	6

In [114]:
l = 'Tier 3'
lower(l)

NameError: name 'lower' is not defined

In [66]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks'],
            'company': ['1st', '1st', '2nd', '2nd'],
            'deaths': ['kkk', '50', 25, 616],
            'battles': [5, [42,50], 2, 2],
            'size': ['l', 'l', 's', 'm']}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'deaths', 'battles', 'size'])
df

     regiment company deaths   battles size
0  Nighthawks     1st    kkk         5    l
1  Nighthawks     1st     50  [42, 50]    l
2  Nighthawks     2nd     25         2    s
3  Nighthawks     2nd    616         2    m

In [67]:
def isFloatable(string):
    try:
        float(string)
        return True
    except Exception as e:
        return False
    
def stringToFloatConversion(s):
    if type(s) in [str,int,float]:
        if type(s) == str:
            if isFloatable(s):
                return float(s)
            else:
                return np.nan
        else:
            return s
    else:
        return np.nan

In [68]:
isError = False
try:
    l = ['deaths', 'battles']
    for i in l:
        df[[i]] = df[[i]].applymap(lambda s : stringToFloatConversion(s))
except Exception as e:
    isError = True
    print(e)

In [69]:
df

     regiment company  deaths  battles size
0  Nighthawks     1st     NaN      5.0    l
1  Nighthawks     1st    50.0      NaN    l
2  Nighthawks     2nd    25.0      2.0    s
3  Nighthawks     2nd   616.0      2.0    m

In [61]:
df['battles'].astype(str)

0       5
1    [42]
2       2
3       2
Name: battles, dtype: object

In [5]:
df=df.apply(lambda x: x.astype(str).str.upper())
df

     regiment company deaths battles size
0  NIGHTHAWKS     1ST    KKK       5    L
1  NIGHTHAWKS     1ST     52      42    L
2  NIGHTHAWKS     2ND     25       2    S
3  NIGHTHAWKS     2ND    616       2    M

In [141]:
columns = ['regiment', 'company', 'deaths', 'battles', 'size']
for i in df.columns:
    if df[i].dtype == 'O':
        print(i)

regiment
company
deaths
size

In [78]:
raw_data = {'regiment': ['Nighthawks', 'Sumegh', 'Bijoy', 'Nighthawks'],
            'company': ['1st', '3rd', '2nd', '2nd'],
            'deaths': ['kkk', '50', 25, 616],
            'battles': [5, 42, 2, 2],
            'size': ['l', 'l', 's', '50']}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'deaths', 'battles', 'size'])
df

     regiment company deaths  battles size
0  Nighthawks     1st    kkk        5    l
1      Sumegh     3rd     50       42    l
2       Bijoy     2nd     25        2    s
3  Nighthawks     2nd    616        2   50

In [79]:
dic = {"column":['regiment','company','size'],
       "regiment":['Sumegh','Bijoy'],
       "size":['l','L','s'],
       "company":['1st','3rd']}

In [91]:
def function(df):
    column = ['regiment','company','size']
    for i in column:
        LIST = dic[i]
        #print (LIST)
        df[[i]].applymap(lambda s: np.nan if not s in LIST else s)
        print(df[[i]])
    return df

In [92]:
a = function(df)
a

AttributeError: 'Series' object has no attribute 'applymap'

In [ ]:
data[[i]].applymap(lambda s: s.lower() if type(s) == str else s)

In [93]:
def function(df):
    column = ['regiment','company','size']
    for i in column:
        LIST = dic[i]
        for count, ele in enumerate(df[i]):
            if not ele in LIST:
                df[i][count] = np.nan
                
    return df

In [94]:
a = function(df)
a

C:\Users\Sumegh\AppData\Local\Temp/ipykernel_10936/1027345859.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[i][count] = np.nan

  regiment company deaths  battles size
0      NaN     1st    kkk        5    l
1   Sumegh     3rd     50       42    l
2    Bijoy     NaN     25        2    s
3      NaN     NaN    616        2  NaN

In [96]:
from datetime import datetime

In [98]:
datetime.now().year-23

1999

In [2]:
import pandas as pd
import numpy as np

In [4]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks'],
            'company': ['1st', '1st', '2nd', '2nd'],
            'deaths': [123, '50', 25, 616],
            'battles': [5, [42,50], 2, 2],
            'size': ['l', 'l', 's', 'm']}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'deaths', 'battles', 'size'])
df

     regiment company deaths   battles size
0  Nighthawks     1st    123         5    l
1  Nighthawks     1st     50  [42, 50]    l
2  Nighthawks     2nd     25         2    s
3  Nighthawks     2nd    616         2    m

In [5]:
def isFloatable(string):
    try:
        float(string)
        return True
    except Exception as e:
        return False
    
def stringToFloatConversion(s):
    if type(s) in [str,int,float]:
        if type(s) == str:
            if isFloatable(s):
                return float(s)
            else:
                return np.nan
        else:
            return s
    else:
        return np.nan

In [6]:
isError = False
try:
    l = ['deaths', 'battles']
    for i in l:
        df[[i]] = df[[i]].applymap(lambda s : stringToFloatConversion(s))
except Exception as e:
    isError = True
    print(e)

In [7]:
df

     regiment company  deaths  battles size
0  Nighthawks     1st   123.0      5.0    l
1  Nighthawks     1st    50.0      NaN    l
2  Nighthawks     2nd    25.0      2.0    s
3  Nighthawks     2nd   616.0      2.0    m

In [8]:
df['battles'] = df['battles']-10

In [9]:
df

     regiment company  deaths  battles size
0  Nighthawks     1st   123.0     -5.0    l
1  Nighthawks     1st    50.0      NaN    l
2  Nighthawks     2nd    25.0     -8.0    s
3  Nighthawks     2nd   616.0     -8.0    m

In [10]:
l = [400,500]
type(l)

list

In [11]:
l = 32

In [13]:
type(l) == np.int32

False